import java.util.Scanner;

public class Quiz {

	protected static int n = 0;//αυξάνεται κατα 1 κάθε φορά που ένας παίκτης απαντά μια ερώτηση----- 0 ΣΩΣΤΟ 1 ΛΑΘΟΣ

	protected static String[] questions = {"Ο γρύπας ήταν μυθικό πλάσμα που αποτελούσε σύμβολο ισχύος είχε σώμα λιονταριού, φτερά αετού και ουρά φιδιού", 
								"Ο θεός Ήλιος μεταμόρφωσε την αγαπημένη του Λευκοθόη περιχύνοντάς την με Αμβροσία σε ηλιοτρόπιο",
								"Ο Evans αποκρυπτογράφησε τη γραμμική Α",
								"Ο Πλάτωνας ήταν μαθητής του Σωκράτη",
						        "Οι πολεμιστές στον στρατό του Αχιλλέα λέγονταν Ηρακλείδες",
							    "Ο Ερμαφρόδιτος ήταν γιος του Ερμή και της Αφροδίτης",
							    "Ο Επιμηθέας ήταν ο θεός του ονείρου",
							    "Ο Κέρβερος είχε σώμα σκύλου",
							    "Ο ιστορικός Ηρόδοτος κατέγραψε τους περσικούς πολέμους",
							    "Ο Ιάσονας για να κερδίσει το θρόνο του έπρεπε να βρει το χρυσόμαλλο δέρας",
							    "Η Ερυάλη, η Μέδουσα και η Σθενώ, σύμφωνα με την μυθολογία ήταν Νύμφες",
							    "Η φράση 'Εύρηκα' ειπώθηκε από τον Αρχιμήδη",
							    "Νύμφες θρέφονταν με Αμβροσία" ,
							    "Η Σκύλλα και η Χάρυβδη ήταν παιδιά του Δία",
							    "Οι Μούσες ήταν 7",
							    "O Διόνυσος έχει ως ιερό ζώο τα άλογα",
							    "Είλωτες αποκαλούνταν οι ξένοι που διέμεναν στη Σπάρτη",
							    "Ο Κέρβερος ήταν το μυθικό πλάσμα του Άδη",
							    "Ο Περίανδρος ήταν φημισμένος τύραννος των Μεγάρων",
							    "Τα Ελευσίνια Μυστήρια διοργανώνονταν προς τιμήν της θεάς Δήμητρας και Περσεφόνης",
							    "Ο Δίας έστειλε στην Γη την Ανδρομέδα για να εκδικηθεί τον Προμηθέα",
							    "Το άλογο του Μέγα Αλέξανδρου λεγόταν Ξάνθος",
							    "Αποτέλεσμα του Πελοποννησιακού πολέμου ήταν οι ήττα των Αθηναίων",
							    "Ο Προμηθέας ήταν ο τιτάνας που χάρισε τη φωτιά στους ανθρώπους",
							    "Ο Ωκεανός ήταν Τιτάνας",
							    "Οι αρχαίοι Ολυμπιακοί Αγώνες διεξάγονταν στους πρόποδες του βουνού Ολύμπου",
							    "Ο γλύπτης Φειδίας δημιούργησε το χρυσελεφάντινο άγαλμα τους Διός, το οποίο βρισκόταν στην Αθήνα",
							    "Η Αφροδίτη ήταν γυναίκα του Ηφαίστου",
							    "Ο πατέρας του Μέγα Αλεξάνρδου ήταν ο Φίπιππος Α'",
							    "Στην ασπίδα της θεάς Αθηνάς απεικονίζεται το κεφάλι της Μέδουσας"};//Ο πινακας που περιέχει τις ερωτήσεις τύπου Σωστό-Λάθος

    protected static int[] answers = {0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0 , 1, 1, 0, 1, 0};

	public static boolean question() {

		System.out.println(questions[n]);
		n = n + 1;

		System.out.println("Παρακαλώ πατήστε 0 αν η ερώτηση είναι σωστή και 1 αν η ερώτηση είναι λάθος.");
		Scanner q = new Scanner(System.in);
		q.close();

		int answer = q.nextInt();
		return answers[n - 1] == answer;
	}

}